In [1]:
from io import StringIO

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Tutorials-Python-In-Hindi/main/mercedesbenz.csv')
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [4]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n')

In [5]:
type(data)

str

In [6]:
StringIO(data)

In [7]:
df1 = pd.read_csv(StringIO(data))

In [8]:
df1

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [9]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [10]:
df = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Tutorials-Python-In-Hindi/main/mercedesbenz.csv',usecols=['X1','X2','X3','X4','X5','X6','X8'])
df.head()

  X1  X2 X3 X4 X5 X6 X8
0  v  at  a  d  u  j  o
1  t  av  e  d  y  l  o
2  w   n  c  d  x  j  x
3  t   n  f  d  x  l  e
4  v   n  f  d  h  d  n

In [11]:
df.to_csv('test.csv')

In [12]:
data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '4,5,6,7\n'
       '8,9,10,')

In [13]:
df1 = pd.read_csv(StringIO(data))

In [14]:
df1

   a  b   c    d
0  1  2   3  4.0
1  4  5   6  7.0
2  8  9  10  NaN

In [15]:
df1.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [16]:
df1 = pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [17]:
df1

   a    b   c    d
0  1  2.0   3  4.0
1  4  5.0   6  7.0
2  8  9.0  10  NaN

In [18]:
df1.info

<bound method DataFrame.info of    a    b   c    d
0  1  2.0   3  4.0
1  4  5.0   6  7.0
2  8  9.0  10  NaN>

In [19]:
df1.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [20]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,2.3')

In [21]:
df = pd.read_csv(StringIO(data),index_col=0)
df

            a    b    c
index
4       apple  bat  5.7
8      orange  cow  2.3